'''
Задача «Самая простая задача на свете».
Описание: Давай сделаем что-то действительно интересное.
Формат ввода
Одно натуральное число ?
Формат вывода
N строк с фразой: "Купи конструктор!"
'''

# Решение задачи «Самая простая задача на свете»
n = int(input('Одно натуральное число: '))
print('Купи конструктор!\n' * n)
